Public Member Functions | Friends | List of all members
ACAPI::Library::v1::LibraryManager Class Referencefinal
Library Management
LibraryManager is the central point of the Library and the LibPart management. More...
#include <LibraryManager.hpp>
 Inheritance diagram for ACAPI::Library::v1::LibraryManager:
 Public Member Functions
Result< void >  | ModifyLibraryList (const std::function< GSErrCode(Modifier &)> &modifierFunc)
Executed the passed modifier scope in a NotUndoable command.
std::vector< Library >  | FindLibraries (const std::function< bool(const Library &)> &selector) const
Find Libraries using a custom selector function.
Result< Library >  | FindLibrary (const std::function< bool(const Library &)> &selector) const
Find Library using a custom selector function.
Result< Library >  | GetLibraryByName (const GS::UniString &name) const
Returns the Library with the given name.
Result< Library >  | GetEmbeddedLibrary () const
A faster way to get the embedded library.
Result< Library >  | GetLibraryOfLibPart (const LibPart &libPart) const
Returns the Library containing the Library Part.
std::vector< LibPart >  | FindLibParts (const std::function< bool(const LibPart &)> &selector) const
Find LibParts using a custom selector function.
Result< LibPart >  | FindLibPart (const std::function< bool(const LibPart &)> &selector) const
Find Library Part using a custom selector function.
Result< LibPart >  | GetLibPartByName (const GS::UniString &name) const
Returns a library part with the filename.
Result< LibPart >  | GetLibPartByGSMObject (const GSMObject &gsmObject) const
Returns the Library Part of the GSMObject.
Result< LibraryTreePath >  | GetLibraryTreePathOfLibPart (const LibPart &libPart) const
Returns the LibraryTreePath of the LibPart.
Result< GS::Guid >  | GetTWID (const LibraryTreePath &libraryTreePath) const
Returns the Teamwork Identifier of the Library Tree location.
Result< GSMObject >  | GetGSMObjectOfLibPart (const LibPart &libPart) const
Returns the .gsm object representation of the Library Part.
Result< GSMObject >  | LoadGSMObjectFromFile (const IO::Location &location) const
Loads a .gsm object from a file.
Result< LibPart >  | GetLibPartByLibInd (Int32 libPartIndex) const
Returns a library part with the given index.
Result< Int32 >  | GetLibIndOfLibPart (const LibPart &libPart) const
Returns the index of the library part.
Result< void >  | AddLibrary (const IO::Location &libraryPath)
Add a libary to the actual library list.
Result< void >  | AddLibrary (const GS::UniString &twServerURL, const GS::UniString &twServerPath)
Add a server libary to the actual library list.
Result< void >  | RemoveLibrary (const Library &library)
Remove a libary from the actual library list. Embedded and Built-In libraries cannot be removed.
 Public Member Functions inherited from ACAPI::v1::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Friends
Result< LibraryManager >  | GetLibraryManager ()
Creates a LibraryManager instance.
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::v1::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::v1::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
LibraryManager is the central point of the Library and the LibPart management.
The Modifier object of the LibraryManager.
Since
Archicad 28
Friends And Related Symbol Documentation
◆ GetLibraryManager
 Result< LibraryManager > GetLibraryManager  |  ( |   | )
friend
Creates a LibraryManager instance.
Returns
The new LibraryManager instance a plan is loaded otherwise APIERR_NOPLAN.
Remarks
This is the entry point of the Library Management on the API.